<center>

Name: Naveed Ftaima

Email: naveedfatimaumer@gmail.com

Github: [github.com/NaveedFatima](http://github.com/naveedfatima)

Purpose of your Document: Machine Learning
</center>

##### Loading Libraries

In [30]:
# Loading Libraries

In [31]:
#library install
%pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\users\naveed_ai&ml\appdata\roaming\python\python313\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\naveed_ai&ml\appdata\roaming\python\python313\site-packages (from pandas) (2.2.0)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\naveed_ai&ml\appdata\roaming\python\python313\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\naveed_ai&ml\appdata\roaming\python\python313\site-packages (from pandas) (2024.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\naveed_ai&ml\appdata\roaming\python\python313\site-packages (from pandas) (2024.2)
Requirement already satisfied: six>=1.5 in c:\users\naveed_ai&ml\appdata\roaming\python\python313\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

In [32]:
#importing libraries
import pandas as pd

#### Loading datasets

In [85]:
#Loading csv file
pd.read_csv("data.csv")

             Name Designation Gender    Age    Salary
0         Mukhtar  Prrofessor      M   37.0  115000.0
1            Aziz     Teacher      M   30.0   35000.0
2          Mohsin    Engineer      M   29.0   50000.0
3   Naveed Fatima     Analyst      F   30.0   70000.0
4           Babar    Engineer      F   25.0  150000.0
5            Aqsa   Scientist      F   22.0       NaN
6          Rafia      Analyst      F   29.0   20000.0
7           Samra   Scientist      F   26.0  115000.0
8           Eman     Engineer      F   28.0   35000.0
9        Abdullah     Teacher      M   55.0       NaN
10          Mosib   Professor      M   60.0   70000.0
11          Ahmed    Engineer      M    NaN   90000.0
12          Ahsan     trainer      M  156.0  110000.0
13          Wajid     Teacher      M   67.0    2000.0
14          Naeem     trainer      M   80.0   16000.0
15         Qaisar  Prrofessor      M   20.0  170000.0
16          Wajid    Engineer      M   85.0  190000.0

In [87]:
df=pd.read_csv("data.csv")

#### preview dataset

In [88]:
df

             Name Designation Gender    Age    Salary
0         Mukhtar  Prrofessor      M   37.0  115000.0
1            Aziz     Teacher      M   30.0   35000.0
2          Mohsin    Engineer      M   29.0   50000.0
3   Naveed Fatima     Analyst      F   30.0   70000.0
4           Babar    Engineer      F   25.0  150000.0
5            Aqsa   Scientist      F   22.0       NaN
6          Rafia      Analyst      F   29.0   20000.0
7           Samra   Scientist      F   26.0  115000.0
8           Eman     Engineer      F   28.0   35000.0
9        Abdullah     Teacher      M   55.0       NaN
10          Mosib   Professor      M   60.0   70000.0
11          Ahmed    Engineer      M    NaN   90000.0
12          Ahsan     trainer      M  156.0  110000.0
13          Wajid     Teacher      M   67.0    2000.0
14          Naeem     trainer      M   80.0   16000.0
15         Qaisar  Prrofessor      M   20.0  170000.0
16          Wajid    Engineer      M   85.0  190000.0

In [36]:
%pip install pandas openpyxl

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\users\naveed_ai&ml\appdata\roaming\python\python313\site-packages (2.2.3)
Requirement already satisfied: openpyxl in c:\users\naveed_ai&ml\appdata\roaming\python\python313\site-packages (3.1.5)
Requirement already satisfied: numpy>=1.26.0 in c:\users\naveed_ai&ml\appdata\roaming\python\python313\site-packages (from pandas) (2.2.0)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\naveed_ai&ml\appdata\roaming\python\python313\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\naveed_ai&ml\appdata\roaming\python\python313\site-packages (from pandas) (2024.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\naveed_ai&ml\appdata\roaming\python\python313\site-packages (from pandas) (2024.2)
Requirement already satisfied: et-xmlfile in c:\users\naveed_ai&ml\appdata\roaming\python\python313\site-packages (from openpyxl) (2.0.0)
Requirement already satisfied: six>=1.5 in c:\users\naveed_ai&ml\appdata\roaming\python\python313\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

In [37]:
pd.read_excel("data.xlsx")

             Name Designation Gender    Age    Salary
0         Mukhtar  Prrofessor      M   37.0  115000.0
1            Aziz     Teacher      M   30.0   35000.0
2          Mohsin    Engineer      M   29.0   50000.0
3   Naveed Fatima     Analyst      F   30.0   70000.0
4           Babar    Engineer      F   25.0  150000.0
5            Aqsa   Scientist      F   22.0       NaN
6          Rafia      Analyst      F   29.0   20000.0
7           Samra   Scientist      F   26.0  115000.0
8           Eman     Engineer      F   28.0   35000.0
9        Abdullah     Teacher      M   55.0       NaN
10          Mosib   Professor      M   60.0   70000.0
11          Ahmed    Engineer      M    NaN   90000.0
12          Ahsan     trainer      M  156.0  110000.0
13          Wajid     Teacher      M   67.0    2000.0
14          Naeem     trainer      M   80.0   16000.0
15         Qaisar  Prrofessor      M   20.0  170000.0
16          Wajid    Engineer      M   85.0  190000.0

In [38]:
# display the top rows

In [39]:
df.head()

            Name Designation Gender   Age    Salary
0        Mukhtar  Prrofessor      M  37.0  115000.0
1           Aziz     Teacher      M  30.0   35000.0
2         Mohsin    Engineer      M  29.0   50000.0
3  Naveed Fatima     Analyst      F  30.0   70000.0
4          Babar    Engineer      F  25.0  150000.0

In [40]:
df.head(7)

            Name Designation Gender   Age    Salary
0        Mukhtar  Prrofessor      M  37.0  115000.0
1           Aziz     Teacher      M  30.0   35000.0
2         Mohsin    Engineer      M  29.0   50000.0
3  Naveed Fatima     Analyst      F  30.0   70000.0
4          Babar    Engineer      F  25.0  150000.0
5           Aqsa   Scientist      F  22.0       NaN
6         Rafia      Analyst      F  29.0   20000.0

In [41]:
# show bottom rows

In [42]:
df.tail()

      Name Designation Gender    Age    Salary
12   Ahsan     trainer      M  156.0  110000.0
13   Wajid     Teacher      M   67.0    2000.0
14   Naeem     trainer      M   80.0   16000.0
15  Qaisar  Prrofessor      M   20.0  170000.0
16   Wajid    Engineer      M   85.0  190000.0

In [43]:
df.tail(6)

      Name Designation Gender    Age    Salary
11   Ahmed    Engineer      M    NaN   90000.0
12   Ahsan     trainer      M  156.0  110000.0
13   Wajid     Teacher      M   67.0    2000.0
14   Naeem     trainer      M   80.0   16000.0
15  Qaisar  Prrofessor      M   20.0  170000.0
16   Wajid    Engineer      M   85.0  190000.0

In [44]:
df.iloc[8:10]

       Name Designation Gender   Age   Salary
8     Eman     Engineer      F  28.0  35000.0
9  Abdullah     Teacher      M  55.0      NaN

In [45]:
%pip install pymupdf

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pymupdf in c:\users\naveed_ai&ml\appdata\roaming\python\python313\site-packages (1.25.1)
Note: you may need to restart the kernel to use updated packages.

In [46]:
import fitz

In [47]:
pdf_document=fitz.open('dummy.pdf')
page=pdf_document.load_page(0)

In [48]:
text=page.get_text()
print(text)

Dummy PDF file

In [49]:
import json

In [50]:
with open('sample1.json', 'r') as file:
    data = json.load(file)

In [51]:
print(data)

{'fruit': 'Apple', 'size': 'Large', 'color': 'Red'}

In [52]:
%pip install python_docx

Defaulting to user installation because normal site-packages is not writeableNote: you may need to restart the kernel to use updated packages.

Requirement already satisfied: python_docx in c:\users\naveed_ai&ml\appdata\roaming\python\python313\site-packages (1.1.2)
Requirement already satisfied: lxml>=3.1.0 in c:\users\naveed_ai&ml\appdata\roaming\python\python313\site-packages (from python_docx) (5.3.0)
Requirement already satisfied: typing-extensions>=4.9.0 in c:\users\naveed_ai&ml\appdata\roaming\python\python313\site-packages (from python_docx) (4.12.2)

In [53]:
import docx

In [54]:
doc = docx.Document('docx.docx')

In [55]:
for p in doc.paragraphs:
    print(p.text)

The text in a Word document is more than just a string. It has font, size, color, and other styling information associated with it. A style in Word is a collection of these attributes. A Run object is a contiguous run of text with the same style. A new Run object is needed whenever the text style changes.
Reading Word Documents

In [56]:
%pip install python-pptx

Defaulting to user installation because normal site-packages is not writeableNote: you may need to restart the kernel to use updated packages.

Requirement already satisfied: python-pptx in c:\users\naveed_ai&ml\appdata\roaming\python\python313\site-packages (1.0.2)
Requirement already satisfied: Pillow>=3.3.2 in c:\users\naveed_ai&ml\appdata\roaming\python\python313\site-packages (from python-pptx) (11.0.0)
Requirement already satisfied: XlsxWriter>=0.5.7 in c:\users\naveed_ai&ml\appdata\roaming\python\python313\site-packages (from python-pptx) (3.2.0)
Requirement already satisfied: lxml>=3.1.0 in c:\users\naveed_ai&ml\appdata\roaming\python\python313\site-packages (from python-pptx) (5.3.0)
Requirement already satisfied: typing-extensions>=4.9.0 in c:\users\naveed_ai&ml\appdata\roaming\python\python313\site-packages (from python-pptx) (4.12.2)

In [57]:
from pptx import Presentation

def extract_text_from_pptx(pptx_path):
    presentation = Presentation(pptx_path)
    extracted_text = ""

    for slide_number, slide in enumerate(presentation.slides):
        extracted_text += f"\nSlide {slide_number + 1}:\n"

        for shape in slide.shapes:
            if hasattr(shape, "text"):
                extracted_text += shape.text + "\n"

    return extracted_text

pptx_path = 'samplepptx.pptx'
text = extract_text_from_pptx(pptx_path)

print(text)

Slide 1:
Sample PowerPoint File
St. Cloud Technical College

Slide 2:
This is a Sample Slide
Here is an outline of bulleted points
You can print out PPT files as handouts using the PRINT >   PRINT WHAT > HANDOUTS option

In [58]:
%pip install pillow

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pillow in c:\users\naveed_ai&ml\appdata\roaming\python\python313\site-packages (11.0.0)
Note: you may need to restart the kernel to use updated packages.

In [59]:
from PIL import Image

In [60]:
im = Image.open("profile.jpg")

##### this is how the image is shown

In [61]:
im.show()

In [63]:
df

             Name Designation Gender    Age    Salary
0         Mukhtar  Prrofessor      M   37.0  115000.0
1            Aziz     Teacher      M   30.0   35000.0
2          Mohsin    Engineer      M   29.0   50000.0
3   Naveed Fatima     Analyst      F   30.0   70000.0
4           Babar    Engineer      F   25.0  150000.0
5            Aqsa   Scientist      F   22.0       NaN
6          Rafia      Analyst      F   29.0   20000.0
7           Samra   Scientist      F   26.0  115000.0
8           Eman     Engineer      F   28.0   35000.0
9        Abdullah     Teacher      M   55.0       NaN
10          Mosib   Professor      M   60.0   70000.0
11          Ahmed    Engineer      M    NaN   90000.0
12          Ahsan     trainer      M  156.0  110000.0
13          Wajid     Teacher      M   67.0    2000.0
14          Naeem     trainer      M   80.0   16000.0
15         Qaisar  Prrofessor      M   20.0  170000.0
16          Wajid    Engineer      M   85.0  190000.0

In [91]:
df["Designation"]

0     Prrofessor
1        Teacher
2       Engineer
3        Analyst
4       Engineer
5      Scientist
6        Analyst
7      Scientist
8       Engineer
9        Teacher
10     Professor
11      Engineer
12       trainer
13       Teacher
14       trainer
15    Prrofessor
16      Engineer
Name: Designation, dtype: object

In [92]:
df.isnull().sum()

Name           0
Designation    0
Gender         0
Age            1
Salary         2
dtype: int64

In [93]:
df["Age"].isnull().sum()

np.int64(1)

In [94]:
df['Age']=df['Age'].fillna(df['Age'].median)

In [95]:
df['Age']

0                                                  37.0
1                                                  30.0
2                                                  29.0
3                                                  30.0
4                                                  25.0
5                                                  22.0
6                                                  29.0
7                                                  26.0
8                                                  28.0
9                                                  55.0
10                                                 60.0
11    <bound method Series.median of 0      37.0\n1 ...
12                                                156.0
13                                                 67.0
14                                                 80.0
15                                                 20.0
16                                                 85.0
Name: Age, dtype: object

In [75]:
#df["Salary"].isnull().sum()

np.int64(2)

In [76]:
#df['Salary']=df['Salary'].fillna(df['Salary'].median)

In [81]:
#df['Salary']

In [96]:
df=df.dropna(subset='Salary')

In [97]:
df['Salary']

0     115000.0
1      35000.0
2      50000.0
3      70000.0
4     150000.0
6      20000.0
7     115000.0
8      35000.0
10     70000.0
11     90000.0
12    110000.0
13      2000.0
14     16000.0
15    170000.0
16    190000.0
Name: Salary, dtype: float64

In [98]:
df.isnull().sum()

Name           0
Designation    0
Gender         0
Age            0
Salary         0
dtype: int64